<?php


return [

    'ding_url' => env('DING_URL'),
    /*
    |-----------------------------------------------------------
    | 【必填】企业 corpId
    |-----------------------------------------------------------
    */
    'corp_id' => env('DING_CORP_ID'),

    /*
    |-----------------------------------------------------------
    | 【必填】应用 AppKey
    |-----------------------------------------------------------
    */
    'app_key' => env('DING_APP_KEY'),

    /*
    |-----------------------------------------------------------
    | 【必填】应用 AppSecret
    |-----------------------------------------------------------
    */
    'app_secret' => env('DING_APP_SECRET'),

    'agent_id' => env('DING_AGENT_ID'),

    /*
    |-----------------------------------------------------------
    | 【选填】加解密
    |-----------------------------------------------------------
    | 此处的 `token` 和 `aes_key` 用于事件通知的加解密
    | 如果你用到事件回调功能，需要配置该两项
    */
    'token' => env('DING_TOKEN'),
    'aes_key' => env('DING_AES_KEY'),

    /*
    |-----------------------------------------------------------
    | 【选填】后台免登配置信息
    |-----------------------------------------------------------
    | 如果你用到应用管理后台免登功能，需要配置该项
    */
    'sso_secret' => env('DING_SSO_SECRET'),

    /*
    |-----------------------------------------------------------
    | 【选填】第三方网站 OAuth 授权
    |-----------------------------------------------------------
    | 如果你用到扫码登录、钉钉内免登和密码登录第三方网站，需要配置该项
    */
    'oauth' => [
        /*
        |-------------------------------------------
         | `app-01` 为你自定义的名称，不要重复即可
         |-------------------------------------------
         | 数组内需要配置 `client_id`, `client_secret`, `scope` 和 `redirect` 四项
         |
         | `client_id` 为钉钉登录应用的 `appId`
         | `client_secret` 为钉钉登录应用的 `appSecret`
         | `scope`:
         |     - 扫码登录第三方网站和密码登录第三方网站填写 `snsapi_login`
         |     - 钉钉内免登第三方网站填写 `snsapi_auth`
         | `redirect` 为回调地址
         */
        'app-qr-login' => [
            'client_id' => env('DING_QR_LOGIN_APP_ID'),
            'client_secret' => env('DING_QR_LOGIN_SECRET'),
            'scope' => env('DING_QR_LOGIN_SCOPE'),
            'redirect' => env('DING_QR_LOGIN_SCOPE_REDIRECT', 'callback'),
        ],
        /*
        |-------------------------------------------
         | 可配置多个 OAuth 应用，数组内内容同上
         |-------------------------------------------
         */
        'app-02' => [
            // ...
        ]
    ]
];
